#include <iostream>
#include "typethai.hpp"
using namespace std;

class สมาชิก
{
private:
    ข้อความ อีเมลล์ = "mail@mail.co.th";
    ข้อความ รหัสผ่าน = "123456";
    ข้อความ ชื่อ = "ใครก็ตาม";
    เลขจำนวนเต็ม อายุ = 299;

public:
    void แสดงข้อมูล()
    {
        cout << "ชื่อ " << ชื่อ << "อายุ " << อายุ << " ขวบ" << endl;
        cout << "อีเมลล์ " << อีเมลล์ << endl;
        cout << "***************************************" << endl;
    }
    void เปลี่ยนเมล(ข้อความ เมลใหม่)
    {
        อีเมลล์ = เมลใหม่;
        cout << "เปลี่ยนเมลล์แล้ววว" << endl;
        cout << "***************************************" << endl;
    }
    void เปลี่ยนรหัสผ่าน(ข้อความ รหัสผ่านใหม่)
    {
        รหัสผ่าน = รหัสผ่านใหม่;
        cout << "เปลี่ยนรหัสผ่านแล้ววว" << endl;
        cout << "***************************************" << endl;
    }
};

int main()
{
    บูลีน โปรแกรมกำลังทำงาน = true;
    เลขจำนวนเต็ม คำสั่ง;
    สมาชิก คน;
    while (โปรแกรมกำลังทำงาน)
    {
        cout << "เลือกคำสั่ง" << endl;
        cout << "   1. แสดงข้อมูล" << endl;
        cout << "   2. เปลี่ยนอีเมลล์" << endl;
        cout << "   3. เปลี่ยนรหัสผ่าน" << endl;
        cout << "เลือก: ";
        cin >> คำสั่ง;

        if (คำสั่ง == 1)
        {
            cout << "***************************************" << endl;
            คน.แสดงข้อมูล();
        }
        else if (คำสั่ง == 2)
        {
            ข้อความ test;
            cout << "***************************************" << endl;
            cout << "กรอกอีเมลล์ : ";
            cin >> test;
            คน.เปลี่ยนเมล(test);
        }
        else if (คำสั่ง == 3)
        {
            ข้อความ test;
            cout << "***************************************" << endl;
            cout << "กรอกรหัสผ่าน : ";
            cin >> test;
            คน.เปลี่ยนเมล(test);
        }
        else
        {
            cout << "***************************************" << endl;
            cout << "คำสั่งไม่ถูกต้อง!..." << endl;
            cout << "***************************************" << endl;
        }
        // switch (คำสั่ง)
        // {
        // case 1:
        //     cout << "***************************************" << endl;
        //     คน.แสดงข้อมูล();
        //     break;
        // case 2:
        //     ข้อความ test;
        //     cout << "***************************************" << endl;
        //     cout << "กรอกอีเมลล์ : ";
        //     cin >> test;
        //     คน.เปลี่ยนเมล(test);
        //     break;
        // case 3:
        //     ข้อความ test;
        //     cout << "***************************************" << endl;
        //     cout << "กรอกรหัสผ่าน : ";
        //     cin >> test;
        //     คน.เปลี่ยนเมล(test);
        //     break;
        // default:
        //     cout << "***************************************" << endl;
        //     cout << "คำสั่งไม่ถูกต้อง!..." << endl;
        //     cout << "***************************************" << endl;
        //     break;
        // }
    }

    return 0;
}